testing/performance-test.yml
config:
  target: "https://reverb.muncak.id"

  # Test phases - Progressive load testing (Optimized for Production)
  # Configured for real-world usage patterns and system capacity
  phases:
    # Phase 1: Warm-up (Baseline)
    - duration: 30
      arrivalRate: 1
      name: "Phase 1: Warm-up"

    # Phase 2: Light Load (Normal viewing)
    - duration: 60
      arrivalRate: 2
      rampTo: 5
      name: "Phase 2: Light Load (2-5 users/sec)"

    # Phase 3: Medium Load (Peak hours)
    - duration: 90
      arrivalRate: 5
      rampTo: 10
      name: "Phase 3: Medium Load (5-10 users/sec)"

    # Phase 4: Heavy Load (High traffic)
    - duration: 120
      arrivalRate: 10
      rampTo: 15
      name: "Phase 4: Heavy Load (10-15 users/sec)"

    # Phase 5: Peak Load (Maximum sustainable)
    - duration: 60
      arrivalRate: 15
      rampTo: 20
      name: "Phase 5: Peak Load (15-20 users/sec)"

    # Phase 6: Cool-down (Recovery)
    - duration: 30
      arrivalRate: 2
      name: "Phase 6: Cool-down"

  processor: "./test-processor.cjs"

  # HTTP configuration
  http:
    timeout: 30  # 30 second timeout for responses
    maxSockets: 50  # Max concurrent connections per host (reduced for stability)
  
  # Environment variables
  variables:
    reverb_host: "{{ $processEnvironment.REVERB_HOST }}"
    reverb_port: "{{ $processEnvironment.REVERB_PORT }}"
    reverb_scheme: "{{ $processEnvironment.REVERB_SCHEME }}"
    reverb_key: "{{ $processEnvironment.REVERB_APP_KEY }}"
    streamId: "2"
  
  # Plugins for enhanced metrics
  plugins:
    expect: {}
    metrics-by-endpoint: {}
  
  # Ensure test completes even with errors
  ensure:
    maxErrorRate: 3  # Target: Less than 3% error rate for production-ready system

scenarios:
  # Scenario 1: Viewer watching stream (70% of traffic)
  - name: "Viewer Watching Stream"
    weight: 70
    flow:
      # 1. Load stream page (HTML view, no JSON capture needed for perf testing)
      - get:
          url: "/live-cam/{{ streamId }}"
          expect:
            - statusCode: 200
          beforeRequest: "recordRequestStart"
          afterResponse: "recordResponseMetrics"
      
      # 2. Get LiveKit token
      - get:
          url: "/live-cam/{{ streamId }}/livekit/token"
          expect:
            - statusCode: 200
          beforeRequest: "recordRequestStart"
          afterResponse: "recordResponseMetrics"
      
      # 3. Subscribe to Reverb channel (WebSocket connection)
      - function: "subscribeToReverbChannel"
      
      # 4. Join viewer count
      - post:
          url: "/live-cam/{{ streamId }}/viewer-count"
          json:
            action: "join"
          expect:
            - statusCode: 200
          beforeRequest: "recordRequestStart"
          afterResponse: "recordResponseMetrics"
      
      # 5. Simulate video quality check (720p)
      - function: "simulateVideoQuality720p"
      
      # 6. Watch stream for random duration
      - think: "{{ $randomNumber(5, 15) }}"

      # 7. Send chat message
      - post:
          url: "/live-cam/{{ streamId }}/chat"
          json:
            username: "Viewer-{{ $randomNumber(1000, 9999) }}"
            message: "Test message {{ $randomString() }}"
          expect:
            - statusCode: 200
          beforeRequest: "recordRequestStart"
          afterResponse: "recordResponseMetrics"
      
      # 8. Continue watching
      - think: "{{ $randomNumber(10, 20) }}"

      # 9. Simulate quality change to 1080p
      - function: "simulateVideoQuality1080p"
      
      # 10. Send another chat message
      - post:
          url: "/live-cam/{{ streamId }}/chat"
          json:
            username: "Viewer-{{ $randomNumber(1000, 9999) }}"
            message: "Another message {{ $randomString() }}"
          expect:
            - statusCode: 200
          beforeRequest: "recordRequestStart"
          afterResponse: "recordResponseMetrics"
      
      # 11. Leave stream
      - post:
          url: "/live-cam/{{ streamId }}/viewer-count"
          json:
            action: "leave"
          expect:
            - statusCode: 200
          beforeRequest: "recordRequestStart"
          afterResponse: "recordResponseMetrics"
      
      # 12. Disconnect from Reverb
      - function: "disconnectReverb"

  # Scenario 2: Heavy Chat Activity (20% of traffic)
  - name: "Heavy Chat Activity"
    weight: 20
    flow:
      # 1. Load stream page
      - get:
          url: "/live-cam/{{ streamId }}"
          expect:
            - statusCode: 200
          beforeRequest: "recordRequestStart"
          afterResponse: "recordResponseMetrics"
      
      # 2. Subscribe to Reverb
      - function: "subscribeToReverbChannel"
      
      # 3. Join viewer count
      - post:
          url: "/live-cam/{{ streamId }}/viewer-count"
          json:
            action: "join"
          expect:
            - statusCode: 200
      
      # 4. Send multiple chat messages rapidly
      - loop:
          - post:
              url: "/live-cam/{{ streamId }}/chat"
              json:
                username: "ChatUser-{{ $randomNumber(1000, 9999) }}"
                message: "Rapid chat {{ $randomString() }}"
              expect:
                - statusCode: 200
              beforeRequest: "recordRequestStart"
              afterResponse: "recordResponseMetrics"
          - think: "{{ $randomNumber(2, 4) }}"
        count: 10
      
      # 5. Leave
      - post:
          url: "/live-cam/{{ streamId }}/viewer-count"
          json:
            action: "leave"
          expect:
            - statusCode: 200
      
      # 6. Disconnect
      - function: "disconnectReverb"

  # Scenario 3: Quick Viewer (Join and Leave - 10% of traffic)
  - name: "Quick Viewer (Bounce)"
    weight: 10
    flow:
      # 1. Load stream page
      - get:
          url: "/live-cam/{{ streamId }}"
          expect:
            - statusCode: 200
          beforeRequest: "recordRequestStart"
          afterResponse: "recordResponseMetrics"
      
      # 2. Subscribe to Reverb
      - function: "subscribeToReverbChannel"
      
      # 3. Join viewer count
      - post:
          url: "/live-cam/{{ streamId }}/viewer-count"
          json:
            action: "join"
          expect:
            - statusCode: 200
      
      # 4. Quick look (2-5 seconds)
      - think: "{{ $randomNumber(2, 5) }}"
      
      # 5. Leave immediately
      - post:
          url: "/live-cam/{{ streamId }}/viewer-count"
          json:
            action: "leave"
          expect:
            - statusCode: 200
      
      # 6. Disconnect
      - function: "disconnectReverb"

# Custom metrics for research parameters
metrics:
  # Latency metrics
  - name: "http_request_latency"
    type: "histogram"
  - name: "websocket_connection_latency"
    type: "histogram"
  - name: "chat_message_latency"
    type: "histogram"
  
  # Connection metrics
  - name: "connection_establishment_time"
    type: "histogram"
  - name: "concurrent_connections"
    type: "gauge"
  - name: "active_websocket_connections"
    type: "gauge"
  
  # Throughput metrics
  - name: "requests_per_second"
    type: "rate"
  - name: "messages_per_second"
    type: "rate"
  
  # Error metrics
  - name: "http_errors"
    type: "counter"
  - name: "websocket_errors"
    type: "counter"
  - name: "total_errors"
    type: "counter"
  
  # Video quality metrics
  - name: "video_quality_720p_stable"
    type: "counter"
  - name: "video_quality_1080p_stable"
    type: "counter"
  - name: "video_quality_changes"
    type: "counter"
  - name: "current_video_quality"
    type: "gauge"
  
  # Viewer metrics
  - name: "viewer_count_updates"
    type: "counter"
  - name: "current_viewer_count"
    type: "gauge"
  
  # Chat metrics
  - name: "chat_messages_sent"
    type: "counter"
  - name: "chat_messages_received"
    type: "counter"
  
  # Reverb metrics
  - name: "reverb_connections_success"
    type: "counter"
  - name: "reverb_connections_failed"
    type: "counter"
  - name: "reverb_disconnections"
    type: "counter"